
## :x: Apply Failed (dev)

[CI link](https://github.com/a-company-jp/lgtm-tf/actions/runs/8671049743)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
google_storage_bucket.public_image_bucket: Refreshing state... [id=lgtm-public-image-bucket]
google_storage_bucket_access_control.public_image_bucket: Refreshing state... [id=lgtm-public-image-bucket/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_firestore_database.datastore_mode_database will be created
  + resource "google_firestore_database" "datastore_mode_database" {
      + app_engine_integration_mode       = (known after apply)
      + concurrency_mode                  = (known after apply)
      + create_time                       = (known after apply)
      + delete_protection_state           = (known after apply)
      + deletion_policy                   = "ABANDON"
      + earliest_version_time             = (known after apply)
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + key_prefix                        = (known after apply)
      + location_id                       = "asia-northeast1"
      + name                              = "(default)"
      + point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED"
      + project                           = "my-project-name"
      + type                              = "DATASTORE_MODE"
      + uid                               = (known after apply)
      + update_time                       = (known after apply)
      + version_retention_period          = (known after apply)
    }

  # google_project_service.vision_api will be created
  + resource "google_project_service" "vision_api" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "lgtmgen-project"
      + service            = "vision.googleapis.com"
    }

  # google_storage_bucket.public_image_bucket will be updated in-place
  ~ resource "google_storage_bucket" "public_image_bucket" {
        id                          = "lgtm-public-image-bucket"
        name                        = "lgtm-public-image-bucket"
        # (14 unchanged attributes hidden)

      ~ cors {
          ~ origin          = [
              + null,
            ]
            # (3 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
google_project_service.vision_api: Creating...
google_firestore_database.datastore_mode_database: Creating...
google_storage_bucket.public_image_bucket: Modifying... [id=lgtm-public-image-bucket]
google_storage_bucket.public_image_bucket: Modifications complete after 2s [id=lgtm-public-image-bucket]
╷
│ Error: Error creating Database: googleapi: Error 403: Cloud Firestore API has not been used in project my-project-name before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/firestore.googleapis.com/overview?project=my-project-name then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry.
│ Details:
│ [
│   {
│     "@type": "type.googleapis.com/google.rpc.Help",
│     "links": [
│       {
│         "description": "Google developers console API activation",
│         "url": "https://console.developers.google.com/apis/api/firestore.googleapis.com/overview?project=my-project-name"
│       }
│     ]
│   },
│   {
│     "@type": "type.googleapis.com/google.rpc.ErrorInfo",
│     "domain": "googleapis.com",
│     "metadata": {
│       "consumer": "projects/my-project-name",
│       "service": "firestore.googleapis.com"
│     },
│     "reason": "SERVICE_DISABLED"
│   }
│ ]
│ 
│   with google_firestore_database.datastore_mode_database,
│   on firestore.tf line 1, in resource "google_firestore_database" "datastore_mode_database":
│    1: resource "google_firestore_database" "datastore_mode_database" {
│ 
╵
╷
│ Error: Error when reading or editing Project Service : Request `List Project Services lgtmgen-project` returned error: Failed to list enabled services for project lgtmgen-project: googleapi: Error 403: Service Usage API has not been used in project 228944830644 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/serviceusage.googleapis.com/overview?project=228944830644 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry.
│ Details:
│ [
│   {
│     "@type": "type.googleapis.com/google.rpc.Help",
│     "links": [
│       {
│         "description": "Google developers console API activation",
│         "url": "https://console.developers.google.com/apis/api/serviceusage.googleapis.com/overview?project=228944830644"
│       }
│     ]
│   },
│   {
│     "@type": "type.googleapis.com/google.rpc.ErrorInfo",
│     "domain": "googleapis.com",
│     "metadata": {
│       "consumer": "projects/228944830644",
│       "service": "serviceusage.googleapis.com"
│     },
│     "reason": "SERVICE_DISABLED"
│   }
│ ]
│ , accessNotConfigured
│ 
│   with google_project_service.vision_api,
│   on vision.tf line 1, in resource "google_project_service" "vision_api":
│    1: resource "google_project_service" "vision_api" {
│ 
╵

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"run-terraform-apply","PRNumber":5,"Program":"tfcmt","SHA1":"964440c58a06ff1423fc7f834e3b5b96208c1190","Target":"dev","Vars":{},"WorkflowName":"Run Terragrunt Apply on main branch push"} -->